[
  {
    "category": "Nigerian Beans Recipes",
    "recipes": [
      {
        "title": "Nigerian Beans Porridge",
        "information": "Beans Porridge Beans known as Ewa to the Yorubas are unpopular staple foods because it is associated with bloating, flatulence and indigestion. Most people have one reason or the other why they do not eat beans. Yet, it is advisable to to have beans in the family menu especially when you have young children in the family.How to Cook Beans Porridge [Video] The cooking method detailed here will help eliminate the problems associated with beans. You can learn more about how you can prevent the problems associated with eating beans at:How to Reduce Beans Bloating. Ingredients 3 cigar cups (approx. 750g) brown/black eyed beansRed palm oil (enough to colour)1 medium onionPepper & Salt (to taste)1 big stock cube500g Yam/Plantain/Sweet Potatoes/Baby Corn (Optional) You can also addcrayfishif you want but I prefer not to add it because it makes the beans have an over-seasoned taste. Before you cook Beans Porridge Soak the beans in cold water for 5 hours. Boil the beans for 5 minutes and discard the water. Wash the beans in cold water and set aside. This soaking and pre-cooking process will help reduce the gas inducing elements.Chop the onions, grind the crayfish (if you are using it) and pepper.If you will use yam/plantain/sweet potatoes, wash, peel and cut them into 1 inch cubes and set aside. If you will use baby corn, drain the preservation liquid, rinse and set aside. Cooking Directions Put the beans in a pot and pour water up to the level of the beans and start cooking.Note:If you have a pressure cooker, beans is one of the staple foods you will want to use it for. It reduces the cooking time considerably.Cook till tender, adding more water from time to time, if necessary. Always keep the water at the same level as the beans so that when the beans is done, you will not have too much water in the porridge.When the beans porridge is soft, add the onions, crayfish (if using it), pepper and seasoning.Add the red palm oil, salt to taste and cook for more 5 minutes on medium heat.Note:To get the most out of beans, it is best to cook it with one of the following: sweet yam, ripe/unripe plantain, sweet potatoes or baby corn. If you will add any of these, this is when to do so. Then instead of cooking for 5 minutes, cook till the added yam / plantain / potatoes is done. The baby corn should be added when you turn off the heat in step 5.Turn off the heat, add the baby corn (if you have chosen to use it), leave to stand for 5 minutes and turn the porridge with a wooden spoon. Note:If you have a pressure cooker, beans is one of the staple foods you will want to use it for. It reduces the cooking time considerably. Note:To get the most out of beans, it is best to cook it with one of the following: sweet yam, ripe/unripe plantain, sweet potatoes or baby corn. If you will add any of these, this is when to do so. Then instead of cooking for 5 minutes, cook till the added yam / plantain / potatoes is done. The baby corn should be added when you turn off the heat in step 5. The beans porridge is ready. If you cooked the beans porridge without any of the additions, serve withFried Plantain,Fried Yamor fried sweet potatoes."
      },
      {
        "title": "African Breadfruit (Ukwa)",
        "information": "African Breadfruit (Ukwa) Plain Ukwa Ingredients 700g African Breadfruit2 medium dry fish2 small stock cubes7g edible potashPalm oil (enough to colour)5-6 fresh bitter leavesPepper & Salt (to taste) Common additions to Breadfruit Porridge: White Puna yamCorn/Maize, you can also use sweet corn Notes on the ingredients Freshly peeled ukwa or dried ukwa can be used for this recipe.You can use stock fish instead of dry fish or both.By fresh bitter leaves I mean bitter leaves that have NOT been washed and squeezed.Always add enough palm oil to make your Nigerian meals look appetizing.Edible potash acts as food tenderizer. Only a very small quantity should be used. If you are lucky to buy freshly dehusked ukwa seeds from the same tree, you will not need to use the food tenderiser. I do not know any alternative to edible potash. Before you cook the Ukwa If using dry ukwa, soak it overnight in plenty of cold water. If using fresh ukwa, skip this step.The next day, soak, debone and wash the dry fish or stock fish and break into pieces.Wash the ukwa thoroughly in cold water. Stones and sand usually settle at the bottom so watch out for those.Pound the pepper.Rinse the bitter leaves and set aside. Cooking Directions Put the thoroughly washed ukwa in a sizeable pot. I used a pressure pot in the video below because it cooks the ukwa much faster.Pour enough water to cover the ukwa. The level of water should be about 1 inch above the level of the ukwa.Add the edible potash. Add the dry fish or stock fish, cover the pot and cook till well done. The ukwa is done when the seeds melt when pressed. You may need to top up the water while cooking so watch it closely. If using a pressure pot, top ups will not be necessary.Add enough palm oil to the well done ukwa, add pepper, stock cubes and salt to taste.Stir. Cover and cook on medium heat till the palm oil changes colour from red to yellow. This should take about 5 minutes.Stir and add the bitter leaves.Cover and leave to simmer or till the leaves wilt but still green and the ukwa is ready to be served. Cooking Ukwa with a Pressure Pot If you have a pressure pot, ukwa is one of the Nigerian recipes that you should use it for because it cuts the cooking time by a lot. For pressure pots, follow the directions above up till Step 2.Then for step 3, add edible potash, dry fish or stock fish, pepper, salt to taste, stock cubes and palm oil.Cover, pressurize and cook for 30 minutes. I set the pressure on my pot to 1 and my cooker to heat 7 (my burner's heat settings range from 1-9).After 30 minutes with the above settings, the ukwa should be well done. Depressurize the pot under running water and add the bitter leaves.Cover and cook till the vegetables wilt but are still green. There is no need to pressurize the pot during this step.Stir and it's done! Note: Breadfruit Porridge gets thicker as it cools down so ensure you have enough porridge in the meal when done. Serve with chilled palm wine, palmy. Awww! Or any other chilled drink."
      },
      {
        "title": "Nigerian Dan Wake",
        "information": "Nigerian Dan Wake Dan Wake which literally means Son of Beans is a Northern Nigerian recipe. You can call Dan Wake Beans Dumplings in English because the preparation is similar.How to Cook Dan Wake [Video]Dan Wake on its own is pretty tasteless just like fufu meals and it relies on a sauce or side dish for its taste just like our fufu meals rely on Nigerian Soups for their tastes.Usually Dan Wake is served with ground cayenne pepper (yaji), you can also use Suya Pepper, hardboiled eggs, sautéed vegetables: onions, cabbage, tomatoes; and you can even see some people crush stock cubes and sprinkle on top. Whatever floats your boat, the Dan Wake is game.For me, I searched far and wide for a tasty sauce to enjoy Dan Wake with and one day I found it: 9jafoodie's Ultimate Nigerian Stir-fry is the ultimate partner for Dan Wake. It contains lots of vegetables, Suya pepper, different Nigerian meats etc. Go check it out! Ingredients The Dan Wake made with the following quantities of ingredients were enjoyed by 3 people. 2 small party cups beans flour1 smallparty cupcassava flour2 teaspoons baking soda or 2 teaspoons edible potash2 tablespoons kuka powderBeef stock Serve Dan Wake with any or all of the following: Ultimate Nigerian Stir-fryGround cayenne pepper (yaji)Suya Pepper (Suya Spice)Sautéed vegetablesSliced VegetablesOnionsCabbageTomatoesCucumberStock CubesHard boiled eggs OnionsCabbageTomatoesCucumber Notes on the ingredients Whatever quantity of Dan Wake you are making, use 2 parts of beans flour to 1 part of cassava flour so like I did above, I used 2 party cups of beans flour and 1 party cup of cassava flour.The job of the cassava flour is to bind the beans flour as it contains lots of starch. If you do not have cassava flour, use plain flour (all-purpose flour).Water is normally used to mix the Dan Wake but I prefer using beef stock because it gives it a better taste rather than the bland taste you get when you mix with water. Even though I use a very tasty sauce to eat Dan Wake, the meal tastes better when it is seasoned all the way through.The job of the edible potash is to make the Dan Wake balls fluffy. I used baking soda (bicarbonate of soda) in the video below, they do the same job.I get the beef stock when I prepare grilled meat. I boil the meat and store the water (stock) in the freezer for preparing these sort of meals. Also, since I normally eat Dan Wake with the Ultimate Nigerian Stir-fry, I will use some of the stock from boiling the meats for the stir-fry to mix the Dan Wake.Kuka Powder which is dried and ground baobab leaves is mucilaginous in nature like Ogbono, not as much as Ogbono though and its job is to help bind the Dan Wake even more.These days some people prepare Dan Wake with only all-purpose flour but the original traditional ingredient for Dan Wake beans flour, try both and see which you prefer. Before you cook Dan Wake There's not much pre-preparation going on with Dan Wake. The only thing is that if you are using edible potash, mix it with a small quantity of water and sieve. You will use only the liquid, no sediments. Set this liquid aside. Cooking Directions Mix all the dry ingredients in a bowl: beans flour, cassava flour, baking soda and kuka powder.If you are using edible potash, add the solution and mix. If not, skip this step.Start adding the beef stock bit by bit and mix the Dan Wake ingredients at the same time till you get a soft sticky dough (see video below). If your beef stock finishes and you still have not achieved a soft sticky dough, continue with warm water.Once you are happy with the dough, set it aside.Pour some water in a pot and set on the stove to boil. The size of your pot and the quantity of water depends on the quantity of Dan Wake you are making. You want a situation where you can put all the molded dumplings in the water and still have lots of room for them to swim around.Once the water boils, start moulding the Dan Wake dough with your fingertips. You pick up a small quantity of the dough (about the size of an adult fufu swallow) with your fingertips and mould into a rough shape (should be like a shapeless amoeba lol) and throw into the boiling water. Repeat till the dough is exhausted. You will notice that the lumps of Dan Wake jumps to the surface of the water as soon as it heats up.Notes:If you want the heart shaped Dan Wake that you can see in the photo above (perfect for St. Valentines btw *wink!), watch the video below to see how I made them with cookie cutters. You can make different shapes the same way.If you used edible potash, the dan wake balls may not be quick to come to the surface when heated but do stir them so they do not stick to the bottom of the pot.Cover the pot and continue cooking on medium heat.After 10 minutes, stir and continue cooking. It should be done in 15 to 20 minutes on low to medium heat. Notes:If you want the heart shaped Dan Wake that you can see in the photo above (perfect for St. Valentines btw *wink!), watch the video below to see how I made them with cookie cutters. You can make different shapes the same way. If you used edible potash, the dan wake balls may not be quick to come to the surface when heated but do stir them so they do not stick to the bottom of the pot. Serve with the aforementioned side dishes and vegetables."
      },
      {
        "title": "How to Cook Ewa Agoyin",
        "information": "Ewa Agoyin Ewa Agoyin with Bread Ewa Agoyin simply means plain boiled beans eaten with a pepper sauce.How to make Ewa Agoyin [Video]This is the perfect way for those who do not like beans to enjoy it. I can tell you that yours truly does not like beans yet, I can never get enough of Ewa Agoyin. I don't know what it is about it that makes it taste so good. Maybe it is the caramelized onions. All I know is that I enjoy eating it. Ingredients 2 cigar cups (approx. 500g) brown/black eyed beans5 cooking spoons red palm oil5 big plum tomatoes1 handfulcrayfish1 big onionPepper & Salt (to taste)2 stock cubes Before you cook Ewa Agoyin Soak the beans in cold water for 5 hours. Boil the beans for 5 minutes and discard the water. Rinse the beans in cold water and set aside. This soaking and pre-cooking process will help reduce the gas inducing elements. For more on that visit:How to Reduce Beans Bloating.Chop the onions, grind the crayfish and pound the pepper.Blend the tomatoes and boil the tomato puree till all the water has dried from it.Pre-cook the diced onions without any added water. The aim is to get it to caramelize a bit so that it will take less time to fully caramelize during frying. Cooking Directions Cook the beans till done. For Ewa Agoyin, the beans needs to be very soft.Note:If you have a pressure cooker, beans is one of the staple foods you will want to use it for. It considerably reduces the cooking time.When the beans is done, add salt, leave to dry up all the water and set aside.To cook the Agoyin, pour the palm oil into a separate dry pot. Allow to heat up till the oil starts smoking and the red colour changes to clear. It is better to do this at medium heat so that the oil does not get too hot too quickly. Remember to turn off your smoke alarm before doing this.To keep the smoke to a minimum and still have the traditional taste of Ewa Agoyin, I use vegetable oil and when it is very hot, I add a small amount of palm oil. Watch the video below to see how I do that.Now add the precooked onions and stir continuously till the onions is fully caramelized. It should be very dark in colour.Add the parboiled tomato puree and stir continuously till you cannot tell the difference between the tomatoes and onions.Add the pepper, crayfish, stock cubes and salt to taste. You can also add a little water at this point if your want.Stir very well and bring to the boil. The Ewa Agoyin is ready! Note:If you have a pressure cooker, beans is one of the staple foods you will want to use it for. It considerably reduces the cooking time. Serve by dishing the beans into a plate and scoop some Agoyin stew on it. Ewa Agoyin can be eaten on its own, with soft and stretchy bread (known as Ewa ati Bread) or withFried Plantains."
      },
      {
        "title": "Jacket Moi Moi",
        "information": "Jacket Moi Moi Jacket Moi Moi"
      },
      {
        "title": "Lentils Porridge",
        "information": "Lentils Porridge Lentils Lentils Porridge [Video] In this recipe, I show how I cook lentils such that it tastes Nigerian. Ingredients 600g lentils1 cooking spoon red palm oil1 small green pepper2 carrots2 red onionBlack pepper (to taste)1 big stock cubeSalt (to taste) Notes on the ingredients Lentils are known as lentils wherever they are available in Nigeria. Look for them in big supermarkets.The quantities of green pepper, carrots and red onions can be adjusted to your taste and how busy or sparse you want these ingredients to appear in the meal. Before you cook Lentils Porridge Rinse the lentils in plenty of cool water.Rinse and dice the green pepper and onions.Scrape, rinse and dice the carrots. Cooking Directions Put the lentils in a pot, pour a generous quantity of water because lentils can absorb lots of water.Add the stock cube, black pepper and start cooking.Note:If you have a pressure cooker, use it to cook lentils because they take a while to cook with a normal pot.When the lentils are very soft, add the onions, carrots, palm oil and salt ans continue cooking.When it heats up, add the green peppers. Cover and let it heat up again.Once it heats up again, stir and serve when it has cooled down to a comfortable temperature. Note:If you have a pressure cooker, use it to cook lentils because they take a while to cook with a normal pot. Aim to have the lentils poridge a bit watery because when it cools down to a confortable temperature, it becomes thicker. You can serve it like that or withFried Plantain."
      },
      {
        "title": "Nigerian Moi Moi",
        "information": "Nigerian Moi Moi Nigerian Moi Moi (also Moin Moin) is a great dish accessory in Nigeria. It is commonly seen accompanying Jollof Rice, Fried Rice, Fried Plantain, Custard, Akamu (Pap, Ogi) etc. It can even be eaten alone as a snack with a chilled soft drink to wash it down.How to Cook Nigerian Moi Moi with Foil Bags [Video]Egg Moi MoiAlmond Coconut Moi MoiHow to Cook Nigerian Moi Moi with Leaves [Video]How to Cook Nigerian Moi Moi with Beans FlourBaked Nigerian Moi MoiDue to its popularity, Moi Moi is often served at parties, dinners and other special occasions. The Ultimate Cooking Nigerian Moi Moi Series Moi Moi can be very challenging to prepare because everything is mixed off the stove before cooking. If you get the mixing wrong, there is no going back once you start cooking. If you have tried cooking Nigerian Moi Moi several times but still cannot get it right, I suggest you watch the series of videos below and I promise you that after watching these videos, without skipping any parts, you will become a professional in cooking Nigerian Moi Moi. Video of all the ingredients and utensils you need to cook Nigerian Moi Moi and why they are important. This video includes how to make aluminium foil bags in case you do not have the moi moi leaves.Click herefor the video.Video of the easiest way to peel beans for Nigerian Moi Moi.Click herefor the video.Part 1 of cooking and baking the Nigerian Moi Moi.Click herefor the video.Part 2 of cooking and baking the Nigerian Moi Moi.Click herefor the video.Part 3 of cooking and baking the Nigerian Moi Moi.Click herefor the video. Because these videos were recorded live, I answered lots of questions asked by those watching me live. So I recommend you take the time to watch all these videos. You will be happy you did. Ingredients I usually cook Moi Moi in a large quantity and store in my freezer so the following quantities of ingredients make 12 aluminium bags of Moi Moi. Each bag weighs 420g. 3 cigar cups or 750g Beans (Brown/Black eyed)5 tablespoons groundcrayfish4 big stock cubes1 habanero pepper2 teaspoons ground nutmeg3 tatashe peppers or 800g watery tomato puree (sold outside Nigeria)2 big onions20cl vegetable oil2 litres of cool or warm waterSalt (to taste) Moi Moi Accessories Add any of the following to the Moi Moi Hard boiled eggs: Cut the eggs into small pieces.Bone Marrow: Cook the bone marrow with spices and herbs till done then add to the Moi Moi at the mixing stage.Corned beef: separate into small chunks and add to the moi moi during mixing. You can also add to the moi moi after dishing then into cooking bowls or foil bags. Moi Moi Containers Aluminium foilorPlastic BowlsorUma Leaves(Thaumatococcus Daniellii)Jacket Moi Moi Tools I used CookerDeep PotSpatulaChopping boardBlenderKnives Notes on the ingredients The tomato puree gives the Moi Moi its classic peachy colour. If you are in Nigeria, the best ingredient to use is tatashe pepper. I do not like the taste of red bell peppers in my Moi Moi hence I do not recommend it but you can try it and see if you like it.Nutmeg gives the Moi Moi its classic taste. If you've ever eaten Nigerian Moi Moi at a party and wondered why it tastes better than the ones you make, it is probably because you do not add nutmeg to your Moi Moi.2 litres of water is the exact quantity of water that gives me the perfect texture of Moi Moi that I and my family love. Please note that this qauntity includes the water used in blending the beans. If using bone marrow, the quantity of stock should be part of the 2 litres of liquid you will use in mixing the Moi Moi. If after using this quantity and you are not happy with the texture, adjust the quantity of water accordingly.It is best to use cool orwarmwater when mixing Moi Moi. You do not want to use hot water for this purpose as it may cause the mix to be lumpy.Using the right amount of oil in your Moi Moi ensures that it has a good texture and rolls off the tongue when you eat it but feel free to use any amount of oil you want. And it is advisable to use tastless and odourless oils in your Moi Moi so that rules out olive oil. Before you cook Moi Moi About three hours before cooking the moi moi, soak and wash the beans toremove the coat. When the entire coat has been removed, place the beans in a bowl and pour enough water to cover it. Leave to soak for three hours. This is so that the best consistency will be achieved when you blend the beans.It is advisable to use one of eggs, bone marrow or corned beef, not the three at the same time. If you will use eggs, cook till hard boiled, cut into small pieces and set aside. If you prefer bone marrow, cook it with salt and Maggi / Knorr cubes and set aside the stock. If it is corned beef you will go for, open the can and separate the beef into small lumps.Now go ahead andprepare the moi moi containers. Next … Wash the tatashe pepper (if using it). Ensure you remove the tatashe seeds as they have a tendency to give meals a bitter taste.Cut the onions into pieces, grind the crayfish with a dry mill. If using the heavy duty grinder in Nigerian markets, these won't be necessary.Crush the stock cubes and set aside. Wash the habanero/scotch bonnet peppers and set aside.Now that the beans is soaked (the bean seed is tender when you pinch it), it is time to blend it. It is very important that you use a very good blender for this purpose. The taste and feel of your Moi Moi depends so much on the consistency of the blend. If in doubt, put a small quantity of bean seeds in your home blender and grind to the best of its ability using as small quantity of water as possible. Feel the resulting paste with your fingers and if you notice any tiny pieces at all, then the blender is not good for Moi Moi. At this time, you may consider using the commercial heavy duty mills at your local market if you are in Nigeria. Yes, you have your health and hygiene concerns but most of the mill operators actually keep their mills clean. And they let you bring your own water and containers. So there you go! How to Cook Moi Moi with Tins Cooking Directions Blend the beans, tatashe or tomato puree, onions, crayfish, habanero pepper and ground nutmeg together with some of the water and pour the mix into a big enough bowl.Add the vegetable oil and the bone marrow stock (if this is what you have chosen to add to your moi moi).Slowly add the remaining water and stir the mixture at the same time till you get a good mix of all the ingredients.Add salt to taste and stir very well.Note:Moi Moi is one of the Nigerian food recipes that is prepared cold. All the mixing and adding of ingredients is done off the stove. That is to say, once you start cooking, there is no going back! You cannot decide to add more salt or seasoning or a new ingredient later. So getting it right at the mixing stage is very important.Pad the base of a big pot, pour some water and set on the stove. The depth of the water should be at most 1 inch.Dish the Moi moi mix into containers of your choice, add egg/bone marrow/corned beef to each container, seal/cover and set them in the pot.Add as small quantity of water as possible at a time while cooking the Moi Moi as detailed inpreparation and use of moi moi containersso that the moi moi will not become watery when done. This is the case especially when using aluminium foil or uma leaves.The length of time you will cook your Moi Moi depends on the quantity and the Moi Moi container you used.The Moi Moi that gets done quickest is the one wrapped in Uma or Banana leaves, followed by Moi Moi wrapped in aluminum foils then the one that takes the most time is Moi Moi cooked in aluminium or plastic plates.But whatever Moi Moi container you use, it is advisable to cook your Moi Moi for at least 1 hour, before checking it. Confirm that it is done by putting a knife through it, if the knife is stained with Moi Moi paste, then the Moi Moi is not done, but if the knife just has a slight smear of Moi Moi, then it's done. Also, when you cut through the Moi Moi, the insides will be set and not watery.If you are cooking a few wraps of Moi Moi in a small pot on high heat, then it will only take about 45 minutes to get done while when you are cooking a large pot of Moi Moi, it will definitely take more than one hour. Note:Moi Moi is one of the Nigerian food recipes that is prepared cold. All the mixing and adding of ingredients is done off the stove. That is to say, once you start cooking, there is no going back! You cannot decide to add more salt or seasoning or a new ingredient later. So getting it right at the mixing stage is very important. Serve with chilled fruit juice or coconut juice. You can also serve withPeppered Fishand as a side dish toJollof Rice,Fried RiceorFried Plantains. For breakfast, serve with Custard or Akamu (Pap, Ogi). How to Cook Moi Moi with Foil How to Cook Moi Moi with Leaves"
      },
      {
        "title": "Nigerian Fried Beans",
        "information": "Nigerian Fried Beans Nigerian Fried Beans is so delicious that even those who do not like beans enjoy it! The closest Nigerian meal is Ewa Agoyin.How to Cook Nigerian Fried Beans [Video]All you have to do is make sure that every single bean seed is well coated with palm oil. So add enough Palm OYEL to the meal. Palm oil is good for you! Ingredients 350g brown or black-eyed beans2 Onions3 cooking spoons palm oil or more1 big stock cubeSalt & Habanero pepper (to taste)Water Side Dish:Fried Plantains Before you cook Fried Beans I usually soak beans in cool water overnight. This greatlyreduces beans bloatingand upset stomach associated with eating beans.The next day, chop 1 onion into thin slices, cut the other one into 4 big chunks then pound/grind the pepper.Rinse the beans and put in a sizeable pot. I rinse it twice.Pre-cook the sliced onions with a few drops of water to soften them a bit. Cooking Directions Set the pot of beans on the stove. Add the stock cube (crushed) and the chunks of onion. Add enough water to cover the beans and start cooking. Cook the beans till very soft, adding water when necessary. Always keep water to the same level as the beans so that by the time the beans is done, there will not be too much water in the pot.Note:If you have a pressure cooker, use it to cook the beans till soft. I normally use my pressure cooker for beans but for this recipe, I prefer a normal pot so that I can have more control, especially towards the end.When the beans is done, add salt, leave to dry up all the water and transfer the beans to another container.Now, set a dry clean pot on the stove, pour the palm oil and heat it up till the oil melts (if congealed). Note that you should only heat it up, not bleach the oil. You will know it is hot enough when a piece of onion dropped into the oil sizzles.Add the precooked onions and stir for a bit.Add the ground Habanero pepper and stir till everything is heated up very well, at most 2 minutes.Add the beans and stir for about 2 minutes. Add salt if necessary.Cover and leave to simmer for about 2 minutes and it's done. Note:If you have a pressure cooker, use it to cook the beans till soft. I normally use my pressure cooker for beans but for this recipe, I prefer a normal pot so that I can have more control, especially towards the end. Serve with theFried Plantains, Soaked Garri or bread."
      },
      {
        "title": "Nigerian Moi Moi with Beans Flour",
        "information": "Nigerian Moi Moi Cooking Nigerian Moi Moi with beans flour can be challenging because during mixing, the dry beans flour does not give a true consistency, unlike when freshly peeled beans is used.Cook Nigerian Moi Moi with Beans Flour [Video]How to Cook Nigerian Moi Moi Peeled BeansHow to Cook Nigerian Moi Moi with LeavesBaked Nigerian Moi Moi The Ultimate Cooking Nigerian Moi Moi Series Moi Moi can be very challenging to prepare because everything is mixed off the stove before cooking. If you get the mixing wrong, there is no going back once you start cooking. If you have tried cooking Nigerian Moi Moi several times but still cannot get it right, I suggest you watch the series of videos below and I promise you that after watching these videos, without skipping any parts, you will become a professional in cooking Nigerian Moi Moi. Video of all the ingredients and utensils you need to cook Nigerian Moi Moi and why they are important. This video includes how to make aluminium foil bags in case you do not have the moi moi leaves.Click herefor the video.Video of the easiest way to peel beans for Nigerian Moi Moi.Click herefor the video.Part 1 of cooking and baking the Nigerian Moi Moi.Click herefor the video.Part 2 of cooking and baking the Nigerian Moi Moi.Click herefor the video.Part 3 of cooking and baking the Nigerian Moi Moi.Click herefor the video. Because these videos were recorded live, I answered lots of questions asked by those watching me live. So I recommend you take the time to watch all these videos. You will be happy you did. Ingredients For 7 big wraps of Nigerian Moi Moi, you will need: 250g beans flour2 tablespoons groundcrayfish3 big stock cubes1 teaspoon ground nutmeg2 onionsSalt and Habanero pepper (to taste)2 Tatashe peppers (deseeded)or 200g watery tomato puree (sold outside Nigeria)3 cooking spoons vegetable oil1.2 litres cool water Moi Moi Accessories They are optional but you can add any of the following to Nigerian Moi Moi: Hard boiled eggs: Cut the eggs into small pieces and add after scooping the Moi Moi mix into bowls, uma wraps or aluminium foil bags.Bone Marrow: Cook the bone marrow with onions, thyme, salt and stock cubes till done then add to the Moi Moi while mixing.Corned beef: separate into small chunks and add to the moi moi during mixing. You can also add to the moi moi after dishing then into cooking bowls or foil bags. Containers Aluminium foilorPlastic BowlsorUma Leaves(Thaumatococcus Daniellii)Jacket Moi Moi Notes on the ingredients The tomato puree gives the Moi Moi its classic peachy colour. If you are in Nigeria, the best ingredient to use is tatashe pepper. I do not like the taste of red bell peppers in my Moi Moi hence I do not recommend it but you can try it and see if you like it.Nutmeg gives the Moi Moi its classic taste. It is very essential.I used 1.2 litres of water because I love soft Moi Moi. This quantity includes the water used to mix the Moi Moi and that used to mix the dry ingredients. If using bone marrow, the quantity of stock should be part of the 1.2 litres of liquid you will use in mixing the Moi Moi. If after using this quantity and you are not happy with the texture, adjust the quantity of water accordingly but I recommend that you use at least 1 litre of water for the 250g of beans flour else the Moi Moi will be hard.It is best to use cool water when mixing the beans flour.Using the right amount of oil in your Moi Moi ensures that it has a good texture and rolls off the tongue when you eat it but feel free to use any amount of oil you want. And it is advisable to use tastless and odourless oils in Nigerian Moi Moi. Before you cook Moi Moi Prepare the moi moi containers.Mix the beans flour with 500mls of cool water, making sure there are minimal lumps. You can achieve this by adding a small quantity of water, mix that then add another small quantity. When done, cover and leave to soak for three hours.It is advisable to use one of eggs, bone marrow or corned beef, not the three at the same time. If you will use eggs, cook till hard boiled, cut each egg into about 4 pieces and set aside. If you prefer bone marrow, cook it with big chunks of onion, salt and stock cubes and set aside the stock. If using corned beef, open the can and separate the beef into small lumps.Wash the tatashe pepper (if using it). Remove the tatashe seeds cut the flesh into tiny pieces. Wash the habanero/scotch bonnet peppers, cut into small pieces and set aside.Cut the onions into pieces, grind the crayfish with a dry mill.Crush the stock cubes and set aside. Grind the nutmeg if you bought the nuts.Mix the ground crayfish, ground nutmeg, crushed stock cubes, pepper and tomato puree with a small amount of water and set aside. Cooking Directions After 3 hours, pour the mixture of ingredients into the bowl of soaked beans flour. Add the chopped onions and tatashe (if using it). Stir very well to mix.Blend the mixture from 1 above in small batches without adding any more water till you get a smooth Moi Moi batter. When done, pour into a big enough bowl.Set a small amount of water on the stove to boil. Use a big pot.Slowly add the remaining water to the Moi Moi batter and stir the mixture at the same time.Add the vegetable oil. If using corned beef, add the pieces now. If using bone marrow, add it with the stock at this time. Remember to reduce the total quantity of water you will use for the recipe by the quantity of the bone marrow stock.Add salt to taste and stir very well.By now the water should have boiled. Add a base for the Moi Moi bags to the pot. You can use a metallic wire mesh, pieces of aluminium foil or plastic bags.Dish the Moi moi mix into containers of your choice, add egg to each container, seal/cover and set them in the pot. When done, cover them with a large piece of aluminium foil or a plastic bag to keep the heat in. Then cover start cooking on medium heat.While cooking, keep an eye on the Moi Moi and add some water if necessary.Cook for at least one and half hours and it should be done. If using bowls, it will take longer. Confirm that it is done by putting a knife through it, if the knife is stained with Moi Moi paste, then the Moi Moi is not done, but if the knife just has a slight smear of Moi Moi, then it's done.Spread the bags out on a tray to cool down to a comfortable temperature. Serve with allNigerian rice dishes,Fried Plantains,Akamu or Ogi(for breakfast) or withSteamed Vegetables. You can also serve Moi Moi as a snack with a chilled drink."
      },
      {
        "title": "Nigerian Okpa, Okpa di Oku, Okpa Wawa",
        "information": "Okpa Wawa Okpa Okpa di oku, Okpa di oku, Okpa! Okpa!! Okpa!!! If you are travelling to Enugu, Nigeria from Onitsha, Lagos etc, anywhere from the west of Enugu, these shouts from Okpa sellers will remind you that you are approaching Enugu.How to Cook Okpa [Video]How to Wrap Okpa [Images]9th Mile Corner in Ngwo near Enugu is well known for the special Okpa that you can trade your valued possession for. The Okpa is so good that many people have tried severally but failed to replicate the unique taste in their own homes.But the secret to making the best Okpa is to use as few ingredients as possible because okpa beans (Bambara Groundnut or Bambara Beans) have a natural delicious flavour. This flavour is ruined when people start adding lots of seasoning to the meal.Other names for Okpa are Igba and Ntucha. Ingredients for Okpa For 12 medium wraps of Okpa, you will need: 450g (1lb or 3½ cups) Okpa flour¾ cup red palm oil1 tablespoon saltHabanero pepper (to taste)1 litre (4 cups) hot water Okpa wrappers In addition to the wrappers below, you will also need a strong food safe string/twine for tying the wrappers. I use the strings from the big Nigerian rice bag, you know, the 50kg bags of rice.I advice that you use bowls as a last resort because Okpa needs to be completely immersed in hot boiling water for an even texture when done. This cannot be achieved with bowls. Dry banana/plantain leavesTough transparent plastic bags that can withstand high heatAluminium foil bagsBowls(use as a last resort) Notes on the ingredients Okpa beansis known as Bambara groundnut or simply Bambara nut. In some parts of the world, it is known as Jugo Beans. There are different species of Okpa. It comes insmall podswhich you crack open to release the seeds. The seeds are very hard and only special heavy duty industrial grinders can easily grind these seeds into powder. So, this one is not a job for your kitchen dry mill.If you live outside Nigeria, you can buy Okpa flour onAmazon. You can also ask family or friends to send you Okpa flour from Nigeria. The customs of most countries will allow it because it is dry powder.You need enough oil to give the okpa a popping yellow colour and to improve the taste.Okpa does not need much seasoning so the ingredients listed above are all you need. Onions andcrayfishruin the natural delicious flavour of okpa.The Okpa mix may seem watery but 1.2 litres of water is the quantity of water you need for the perfect Okpa texture. If you add much less water, you will end up with rocky Okpa. If you live outside Nigeria, you can buy Okpa flour onAmazon. You can also ask family or friends to send you Okpa flour from Nigeria. The customs of most countries will allow it because it is dry powder. Before you cook Okpa Prepare the banana leaves by washing them in plenty of salt water. If you have a banana/plantain tree in your backyard, you need to wilt the leaves by passing them over a low flame, then leave them to dry up before using them. You cannot wrap Okpa with fresh banana leaves.Crush the stock/bouillon cubes.Slice the habanero pepper into small pieces.Prepare 1.2 litres of lukewarm water. Cooking Directions Sift the Okpa flour into a big enough bowl. Add salt and the crushed stock cubes. Mix very well.Add the palm oil. Mix the palm oil and flour very well till the palm oil is well incorporated into the flour. You will have a niceeven yellow colourwhen done.Pour a generous quantity of water in a big pot and set on the stove to boil.Start adding the lukewarm water to the Okpa flour and mix till there are no lumps. Watch the video below to see how I crush the lumps without stress by passing the mix through a sieve with a wire mesh. You can also use a blender to get the smoothest mix. But that's a lot of washing up to do later.Add the sliced habanero pepper. Check for salt and add more if necessary and it's ready to be scooped into the wrappers!Now the water in the pot should be boiling. If not, wait for it to boil and add some spare wrappers or plastic bags before moving on to the next step. These wrappers and plastic bags act as a base for the Okpa wraps.Now to a major step: wrapping the Okpa! In the video and images below, I showed 3 ways to wrap Okpa: 2 with the banana leaves and 1 with plastic bags. Hopefully the images and explanations make sense but if you really want to master wrapping the Okpa, watching the video is so worth it. Go to a cyber cafe if you can't watch it on your phone/gadget. Some things just can't be adequately explained in writing.After tying one end of the banana leaves as shown in the video and image links below, stir the okpa mix very well and scoop into the leaf/plastic bag. Tie the other end with a string and place the wrapped okpa in the pot of boiling water. It is important that the Okpa is completely immersed in the hot water.Repeat the above step for the rest of the mix. Make sure you stir the mix, scoop into the wrapper, tie with the string and put in the pot of boiling water before wrapping another one.When done, cover the wraps with more leaves or plastic bags. Cover the pot and start cooking medium to high heat.Cook for at least 1 hour before checking it. The Okpa is done when it is solid all over. Wrapping Okpa Click on the links to view images. How to wrap Okpa with banana leaves (Method common in Enugu State, Nigeria)Place 2 sheetsof banana leaves on a flat surface.Fold one endto meet the other (vertically).Roll upthe open end like a mat till you have enough fold to prevent a leakage.Gather one end togetherand tie it up securely with the string.Stir and pour the mix into the bag.Tie upthe other end and it is ready to go into the pot of boiling water.How to wrap Okpa with banana leaves (method common in Anambra State, Nigeria)Place 2 sheetsof banana leaves on a flat surface.Fold itinto 2 (horizontally).Roll upone the open end like a mat till you have enough fold to prevent a leakage.Pick it up and place the pointed end in the cup of your palm.Stir and pour the mixinto the bag.Fold the other end like a mat andgather the only open endtogether and tie it up securely with the string.And it is ready to go into the pot of boiling water.How to wrap Okpa with plastic bags (if you do not have banana leaves)You can simply scoop the okpa mix into plastic bags, tie it up and place in the pot of boiling water but this is how to get the classic Okpa shape when using plastic bags.Double the plastic bags andtie the endwith a string.Stir and scoop the mix into the bag.Tie itabout half way up the bag.Stir and scoop the mix into the second half of the bag.Tie againand it is ready to go into the pot of boiling water. Place 2 sheetsof banana leaves on a flat surface.Fold one endto meet the other (vertically).Roll upthe open end like a mat till you have enough fold to prevent a leakage.Gather one end togetherand tie it up securely with the string.Stir and pour the mix into the bag.Tie upthe other end and it is ready to go into the pot of boiling water. Place 2 sheetsof banana leaves on a flat surface.Fold itinto 2 (horizontally).Roll upone the open end like a mat till you have enough fold to prevent a leakage.Pick it up and place the pointed end in the cup of your palm.Stir and pour the mixinto the bag.Fold the other end like a mat andgather the only open endtogether and tie it up securely with the string.And it is ready to go into the pot of boiling water. Double the plastic bags andtie the endwith a string.Stir and scoop the mix into the bag.Tie itabout half way up the bag.Stir and scoop the mix into the second half of the bag.Tie againand it is ready to go into the pot of boiling water. For breakfast, serve with cocoa drink (Milo, Ovaltine drink),Akamu or Ogi, custard meal or oatmeal. For lunch or dinner, serve with soaked Garri (asoki). You can also eat it as a snack with a chilled drink."
      },
      {
        "title": "Peeled Beans Porridge",
        "information": "Peeled Beans Porridge Ingredients for Peeled Beans Porridge (baby food version) 2 cigar cups (approx. 500g) beans (brown/black-eyed)2 cooking spoons red palm oil1 tablespoon groundcrayfish1 medium onionPepper and salt (to taste)1 big stock cube100g chicken breast Ingredients for Peeled Beans Porridge (Ukwa version) If you want your Peeled Beans Porridge to taste like Breadfruit Porridge (Ukwa) please use the following ingredients: 2 cigar cups (approx. 500g) beans (brown/black-eyed)2 cooking spoons red palm oil1 tablespoon groundcrayfish1 medium onionPepper and salt (to taste)1 big stock cubeDry Fish Notes on the ingredients: If you want to prepare this recipe for a baby that is less than 1 year old, please do not add salt.If you don’t feel comfortable adding pepper to your baby’s food, please skip this ingredient. Before you cook Peeled Beans Porridge Remove the beans coat.Chop the onions, grind the crayfish and pepper.Cut the chicken breast into small pieces.If you are cooking the breadfruit-taste-alike version, soak the dry fish and separate into small pieces. Cooking Directions Put the peeled beans in a pot, pour water up to the same level as the beans and start cooking. If using the dry fish, add it at this time.Cook till tender adding more water from time to time, if necessary. Always keep the water at the same level as the beans so that when the beans is done, you will not have too much water in the porridge.When the beans is soft, add the onions, crayfish, pepper and seasoning, stir well.Add palm oil and cook till the oil changes to deep yellow.Stir very well, add salt to taste and it is ready to be served. Bear in mind that the porridge may look watery at this time but it gets thicker when it has cooled down. If you prepared it for your baby, place single feed portions in a flat plate, wrap with a plastic film and freeze.Once frozen, remove the now solidified portions and place in a ziploc bag or container and put back in the freezer. So when you want to feed your baby, all you need to do is bring one portion out and warm it up in the microwave. Watch the video below to see how I did that and watch my daughter enjoying her Peeled Beans Porridge."
      },
      {
        "title": "White Moi Moi (Ekuru)",
        "information": "White Moi Moi Ekuru White Moi Moi (Ekuru) is another way to enjoy beans. With a little alteration, it is suitable for vegetarians.White Moi Moi [Video] White Moi Moi (Ekuru) is to regular Moi Moi what Agidi is to Agidi Jollof or what Boiled White Rice is to Jollof Rice. It is prepared the same way as regular Moi Moi but with less added ingredients. It gets most of its taste and colour from the stew it is served with. On its own, White Moi Moi is tasty due to the seasoning it contains so you can skip the stew and enjoy it with a chilled drink. How to Cook Nigerian Moi Moi with LeavesHow to Cook Nigerian Moi Moi with Beans Flour Ingredients For 4 medium wraps of White Moi Moi, you will need: For the White Moi Moi 360g black eyed or brown beans1 small onion1 big stock cubeSalt (to taste)600mls lukewarm water2 cooking spoons vegetable oil (optional) For the stew 250mlsTomato Stew2 small smoked mackerels1 small onion1 small stock cubeSalt and Habanero pepper (to taste)1 teaspoon nutmeg White Moi Moi Containers Aluminium foilorPlastic BowlsorUma Leaves(Thaumatococcus Daniellii) Tools BlenderSpatulaBowls Note about the ingredients The job of the vegetable oil is to help the Moi Moi come out of the container easily when done. Before you cook White Moi Moi About three hours before cooking the moi moi, soak andpeel the beans.When done with step 1, put the peeled beans in a bowl and pour enough water to cover it. Leave to soak for three hours. This is so that the best consistency will be achieved when you blend the beans.Prepare Tomato Stew if you do not have some.Prepare the moi moi containers.Prepare some Smoked Fish and break into big chunks.Pound/grind the pepper.Cut the onions into small pieces.Crush the stock cubes. Cooking Directions: The White Moi Moi Blend the beans with the onions and crushed stock cubes and pour into a big enough bowl. Please note that the total quantity of water to be used (for blending and mixing) should be 600 mls.Add the vegetable oil (if using it) and stir.Slowly add the remaining water and stir the mixture at the same time till you get a good mix of all the ingredients.Add salt to taste and stir very well.Set some water in a pot to boil. The water should be about 1 cm deep.When the water boils, add some padding that will be a base for the Moi Moi wraps.Scoop the Moi Moi mix into your container of choice and gently place in the pot of boiling water.Repeat step 7 for the rest of the Moi Moi mix.When done, cover the wraps with some leaves or a plastic bag to keep the heat in.Cover the pot and start cooking on medium heat.Check it from time to time and add small quantities of water at a time when necessary.The length of time you will cook your Moi Moi depends on the quantity and the Moi Moi container you used.The Moi Moi that gets done quickest is the one wrapped in Uma or Banana leaves, followed by Moi Moi wrapped in aluminum foils then the one that takes the most time is Moi Moi cooked in aluminium or plastic plates.But whatever Moi Moi container you use, it is advisable to cook your Moi Moi for at least 1 hour, before checking it. Confirm that it is done by putting a knife through it, if the knife is stained with Moi Moi paste, then the Moi Moi is not done, but if the knife just has a slight smear of Moi Moi, then it's done. Also, when you cut through the Moi Moi, the insides will be set and not watery.If you are cooking a few wraps of Moi Moi in a small pot on high heat, then it will only take about 45 minutes to get done while when you are cooking a large pot of Moi Moi, it will definitely take more than one hour. Cooking Directions: The Stew You can eat white Moi Moi with any tomato based stew, make sure the stew is seasoned with at least one traditional ingredient:smoked fish, iru,crayfish. This is how I prepare mine and it is so delicious, goes really well with the beans. Put the chunks of fish in a clean pot.Add the onions, some water, stock cube, pepper and nutmeg. Stir and start cooking.Once it boils, add the tomato stew.Cover and leave to simmer and it’s done! Serve with the stew or skip the stew and serve the White Moi Moi with a chilled soft drink."
      }
    ]
  }
]